Date: 15.12.2016
Number of classes: 5
Epoch time: 550s ~ 9 min
Accuracy: 58.97%
alligator: 2.07%     6/290
antelope: 75.11%     169/225
bat: 34.73%     91/262
bear: 41.79%     145/347
bison: 53.68%     175/326
TOTAL: 40.41%     586/1450

Model: 
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
convolution2d_1 (Convolution2D)  (None, 32, 64, 64)    896         convolution2d_input_1[0][0]      
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 32, 64, 64)    0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 32, 64, 64)    9248        dropout_1[0][0]                  
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 32, 32, 32)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 64, 32, 32)    18496       maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 64, 32, 32)    0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 64, 32, 32)    36928       dropout_2[0][0]                  
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 64, 16, 16)    0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 128, 16, 16)   73856       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 128, 16, 16)   0           convolution2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 128, 16, 16)   147584      dropout_3[0][0]                  
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 128, 8, 8)     0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 8192)          0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 8192)          0           flatten_1[0][0]                  
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1024)          8389632     dropout_4[0][0]                  
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 1024)          0           dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 512)           524800      dropout_5[0][0]                  
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 512)           0           dense_2[0][0]                    
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 5)             2565        dropout_6[0][0]                  
====================================================================================================
Total params: 9204005
____________________________________________________________________________________________________
None
Train on 5796 samples, validate on 1450 samples


Epoch 1/25
5796/5796 [==============================] - 745s - loss: 1.5853 - acc: 0.2619 - val_loss: 1.5337 - val_acc: 0.3283


Epoch 2/25
5796/5796 [==============================] - 646s - loss: 1.5093 - acc: 0.3363 - val_loss: 1.5189 - val_acc: 0.3931


Epoch 3/25
5796/5796 [==============================] - 631s - loss: 1.4640 - acc: 0.3741 - val_loss: 1.4758 - val_acc: 0.3848


Epoch 4/25
5796/5796 [==============================] - 629s - loss: 1.4052 - acc: 0.3996 - val_loss: 1.4234 - val_acc: 0.3793


Epoch 5/25
5796/5796 [==============================] - 629s - loss: 1.3529 - acc: 0.4341 - val_loss: 1.3489 - val_acc: 0.4655


Epoch 6/25
5796/5796 [==============================] - 629s - loss: 1.3061 - acc: 0.4579 - val_loss: 1.3418 - val_acc: 0.4469


Epoch 7/25
5796/5796 [==============================] - 628s - loss: 1.2558 - acc: 0.4933 - val_loss: 1.2658 - val_acc: 0.4876


Epoch 8/25
5796/5796 [==============================] - 629s - loss: 1.2359 - acc: 0.4912 - val_loss: 1.2746 - val_acc: 0.4648


Epoch 9/25
5796/5796 [==============================] - 629s - loss: 1.2013 - acc: 0.5133 - val_loss: 1.2154 - val_acc: 0.4979


Epoch 10/25
5796/5796 [==============================] - 629s - loss: 1.2016 - acc: 0.5091 - val_loss: 1.2063 - val_acc: 0.5228


Epoch 11/25
5796/5796 [==============================] - 629s - loss: 1.1682 - acc: 0.5205 - val_loss: 1.2032 - val_acc: 0.5097


Epoch 12/25
5796/5796 [==============================] - 628s - loss: 1.1156 - acc: 0.5509 - val_loss: 1.1488 - val_acc: 0.5152


Epoch 13/25
5796/5796 [==============================] - 628s - loss: 1.0930 - acc: 0.5607 - val_loss: 1.1293 - val_acc: 0.5497


Epoch 14/25
5796/5796 [==============================] - 629s - loss: 1.0417 - acc: 0.5821 - val_loss: 1.0945 - val_acc: 0.5545


Epoch 15/25
5796/5796 [==============================] - 629s - loss: 1.0063 - acc: 0.6032 - val_loss: 1.0812 - val_acc: 0.5724


Epoch 16/25
5796/5796 [==============================] - 629s - loss: 0.9610 - acc: 0.6284 - val_loss: 1.0679 - val_acc: 0.5800


Epoch 17/25
5796/5796 [==============================] - 628s - loss: 0.9468 - acc: 0.6263 - val_loss: 1.0712 - val_acc: 0.5800


Epoch 18/25
5796/5796 [==============================] - 629s - loss: 0.9170 - acc: 0.6403 - val_loss: 1.0134 - val_acc: 0.6041


Epoch 19/25
5796/5796 [==============================] - 629s - loss: 0.8300 - acc: 0.6794 - val_loss: 1.0165 - val_acc: 0.6034


Epoch 20/25
5796/5796 [==============================] - 628s - loss: 0.7958 - acc: 0.6946 - val_loss: 1.0394 - val_acc: 0.5986


Epoch 21/25
5796/5796 [==============================] - 629s - loss: 0.7481 - acc: 0.7146 - val_loss: 1.0259 - val_acc: 0.6138


Epoch 22/25
5796/5796 [==============================] - 630s - loss: 0.6975 - acc: 0.7326 - val_loss: 1.0503 - val_acc: 0.5993


Epoch 23/25
5796/5796 [==============================] - 629s - loss: 0.6498 - acc: 0.7557 - val_loss: 1.0391 - val_acc: 0.6103


Epoch 24/25
5796/5796 [==============================] - 629s - loss: 0.5744 - acc: 0.7831 - val_loss: 1.0285 - val_acc: 0.6262


Epoch 25/25
5796/5796 [==============================] - 629s - loss: 0.5278 - acc: 0.8049 - val_loss: 1.1071 - val_acc: 0.5897
Accuracy: 58.97%


